INSERT INTO`goodroad`.`express_milestone`
(
`num`,
`name`,
`eng_name`,
`distance`,
`miles`
)
VALUES
('1','당진분기점','DangjinJC','0','0.00')
,('2','면천','Myeoncheon','4.04','4.04')
,('3','고덕','Godeok','8.66','12.70')
,('4','예산수덕사','Yesan-Sudeoksa','11.68','24.38')
,('5','신양','Sinyang','12.51','36.89')
,('6','유구','Yugu','10.53','47.42')
,('7','마곡사','Magoksa','9.14','56.56')
,('8','서공주분기점','W.GongjuJC','3.79','60.35')
,('9','공주분기점','GongjuJC','2.67','63.02')
,('10','공주','Gongju','2.87','65.89')
,('11','서세종','W.Sejong','7.00','72.89')
,('12','남세종','S.Sejong','12.56','85.45')
,('13','유성분기점','YuseongJC','6.13','91.58')
,('13-1','북대전','N.Daejeon','4.61','96.19')
,('13-2','회덕분기점','HoedeokJC','3.61','99.80')
,('13-3','신탄진','Sintanjin','4.08','103.88')
,('13-4','남청주','S.Cheongju','11.08','114.96')
,('17','청주분기점','CheongjuJC','3.50','118.46')
,('18','문의','Munui','8.10','126.56')
,('19','회인','Hoein','10.70','137.26')
,('20','보은','Boeun','10.82','148.08')
,('21','속리산','Songnisan','5.98','154.06')
,('22','화서','Hwaseo','16.23','170.29')
,('23','남상주','S.Sangju','18.95','189.24')
,('24','낙동분기점','NakdongJC','8.64','197.88');

update express_milestone
set road_type=1
where road_type is null;

update express_milestone
set keyword=concat(name,'ic');